Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_fdcan2.h
#define FDCAN2_TTOST_SPL        (0x1U<<31)
#define FDCAN2_TTOST_WECS       (0x1U<<30)
#define FDCAN2_TTOST_AWE        (0x1U<<29)
#define FDCAN2_TTOST_WFE        (0x1U<<28)
#define FDCAN2_TTOST_GSI        (0x1U<<27)
#define FDCAN2_TTOST_TMP        (0x7U<<24)
#define FDCAN2_TTOST_TMP_0      (0x1U<<24)
#define FDCAN2_TTOST_GFI        (0x1U<<23)
#define FDCAN2_TTOST_WGTD       (0x1U<<22)
#define FDCAN2_TTOST_RTO        (0xFFU<<8)
#define FDCAN2_TTOST_RTO_0      (0x1U<<8)
#define FDCAN2_TTOST_QCS        (0x1U<<7)
#define FDCAN2_TTOST_GTP        (0x1U<<6)
#define FDCAN2_TTOST_SYS        (0x3U<<4)
#define FDCAN2_TTOST_SYS_0      (0x1U<<4)
#define FDCAN2_TTOST_MS         (0x3U<<2)
#define FDCAN2_TTOST_MS_0       (0x1U<<2)
#define FDCAN2_TTOST_EL         (0x3U<<0)
#define FDCAN2_TTOST_EL_0       (0x1U<<0)

// TURNA Configuration

#define FDCAN2_TURNA_NAV        (0x3FFFFU<<0)
#define FDCAN2_TURNA_NAV_0      (0x1U<<0)

// TTLGT Configuration

#define FDCAN2_TTLGT_GT         (0xFFFFU<<16)
#define FDCAN2_TTLGT_GT_0       (0x1U<<16)
#define FDCAN2_TTLGT_LT         (0xFFFFU<<0)
#define FDCAN2_TTLGT_LT_0       (0x1U<<0)

// TTCTC Configuration

#define FDCAN2_TTCTC_CC         (0x3FU<<16)
#define FDCAN2_TTCTC_CC_0       (0x1U<<16)
#define FDCAN2_TTCTC_CT         (0xFFFFU<<0)
#define FDCAN2_TTCTC_CT_0       (0x1U<<0)

// TTCPT Configuration

#define FDCAN2_TTCPT_SWV        (0xFFFFU<<16)
#define FDCAN2_TTCPT_SWV_0      (0x1U<<16)
#define FDCAN2_TTCPT_CT         (0x3FU<<0)
#define FDCAN2_TTCPT_CT_0       (0x1U<<0)

// TTCSM Configuration

#define FDCAN2_TTCSM_CSM        (0xFFFFU<<0)
#define FDCAN2_TTCSM_CSM_0      (0x1U<<0)

// TTTS Configuration

#define FDCAN2_TTTS_EVTSEL      (0x3U<<4)
#define FDCAN2_TTTS_EVTSEL_0    (0x1U<<4)
#define FDCAN2_TTTS_SWTDEL      (0x3U<<0)
#define FDCAN2_TTTS_SWTDEL_0    (0x1U<<0)
